---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.GetNumberOfNodes
source: html/fbc8f343-ec8b-71ca-f079-e65b63bef550.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData.GetNumberOfNodes Method

Returns the number of analytical nodes.

## Syntax (C#)
```csharp
public int GetNumberOfNodes()
```